Repository: TheRealF/storiapubblicadigitale
Catalog: modules/XML Viewer/language/*.po
Languages: fr

source: The module requires the php extension "xsl".
fr: Ce module nécessite l'extension php "xsl".

source: See module’s installation documentation.
fr: Voir la documentation d’installation du module.

source: To render xml, map each specific xml media-type with a css or xsl in settings and site settings.
fr: Pour afficher le xml, faire correspondre chaque média-type xml spécifique avec un css ou une xsl dans les paramètres globaux et dans les paramètres de site.

source: To specify a precise xml media-type, for example "application/tei+xml" instead of "application/xml", batch edit them.
fr: Pour indiquer un média-type xml précis, par exemple « application/tei+xml » au lieu de « application/xml », lancer un traitement en lot.

source: To specify a precise xml media-type, for example "application/tei+xml" instead of "application/xml", batch edit them with module {link}Bulk Edit{link_end}.
fr: Pour indiquer un média-type xml précis, par exemple « application/tei+xml » au lieu de « application/xml », lancer un traitement en lot avec le module {link}Bulk Edit{link_end}.

source: XML Viewer
fr: Visionneuse XML

source: Players
fr: Lecteurs

source: Render by xml media-type
fr: Rendu par média-type xml

source: Set the rendering as a stylesheet (xsl or css, full url or asset file) or a specific format ("text", "original", "no") to use by media-type, one by line. Other xml types are rendered as a download link. You may set precise media-types with module Bulk Edit too.
fr: Indiquer le rendu par une feuille de style (xsl ou css, adresse url complète ou fichier du dossier « asset ») ou une valeur (« text », « original », « no ») à utiliser pour chaque média-type, une par ligne. Les autres types xml seront rendus comme un lien de téléchargement. Vous pouvez également indiquer des médias-types précis avec le module Bulk Edit.

source: Media #%s is not a file.
fr: Le média #%s n’est pas un fichier.

source: Media #%s has no original file.
fr: Le média #%s n’a pas de fichier original.

source: Media #%s has no original file url.
fr: Le média #%s n’a pas d’url pour le fichier original.

source: Media #%s has no readable file.
fr: Le média #%s n’a pas fichier lisible.
