Repository: TheRealF/storiapubblicadigitale
Catalog: modules/ModelViewer/language/*.po
Languages: fr

source: The library "%s" should be installed.
fr: La bibliothèque "%s" doit être installée.

source: See module’s installation documentation.
fr: Consulter la documentation d’installation du module.

source: This module requires the module "%s".
fr: Ce module requiert le module "%s".

source: This module requires modules "%s".
fr: Ce module requiert les modules "%s".

source: This module has resources that cannot be installed.
fr: Ce module a des ressource qui ne peuvent pas être installées.

source: The module "%s" was automatically deactivated because the dependencies are unavailable.
fr: Le module "%s" a été automatiquement désactivé car ses dépendances ne sont plus disponibles.

source: If your json and xml files are not recognized as model, install modules Bulk Edit and/or Xml Viewer.
fr: Si vos fichiers json et xml ne sont pas reconnus en tant que modèles, installez les modules Bulk Edit et/ou Xml Viewer.

source: Model Viewer
fr: Visionneuse de modèles

source: Media property for specific config
fr: Propriété du média pour la configuration spécifique

source: It is recommended to hide it on public display.
fr: Il est recommandé de cacher cette valeur dans l’affichage public.

source: Default scene config (json)
fr: Configuration de la scène par défaut (json)

source: [Model viewer]: Main config is not a valid json.
fr: [Model viewer] : la configuration principale n’est pas un json valide.

source: [Model viewer]: Specific config for media %d is not a valid json.
fr: [Model viewer]: La configuration spécifique du média %d n’est pas un json valide.
